In [2]:
import numpy as np
import pandas as pd

1. Define a series with even values from 100 to 200 in descending order

In [4]:
ser1 = pd.Series([i for i in range(200,99,-2)])

In [5]:
ser1

0     200
1     198
2     196
3     194
4     192
5     190
6     188
7     186
8     184
9     182
10    180
11    178
12    176
13    174
14    172
15    170
16    168
17    166
18    164
19    162
20    160
21    158
22    156
23    154
24    152
25    150
26    148
27    146
28    144
29    142
30    140
31    138
32    136
33    134
34    132
35    130
36    128
37    126
38    124
39    122
40    120
41    118
42    116
43    114
44    112
45    110
46    108
47    106
48    104
49    102
50    100
dtype: int64

2.Assign index to this series starting from 100

In [17]:
ser2 = pd.Series([i for i in range(200,99,-2)],index = [i for i in range(100,151)])

In [18]:
print(ser2)

100    200
101    198
102    196
103    194
104    192
105    190
106    188
107    186
108    184
109    182
110    180
111    178
112    176
113    174
114    172
115    170
116    168
117    166
118    164
119    162
120    160
121    158
122    156
123    154
124    152
125    150
126    148
127    146
128    144
129    142
130    140
131    138
132    136
133    134
134    132
135    130
136    128
137    126
138    124
139    122
140    120
141    118
142    116
143    114
144    112
145    110
146    108
147    106
148    104
149    102
150    100
dtype: int64

3. Create a dataframe of random values of shape 8*6 . Assign index as numerical values and column names from a to f and using loc and iloc print values of rows 3,4 and columns b and e

In [25]:
df = pd.DataFrame(np.random.randn(8,6),index = [i for i in range(1,9)],columns = 'a b c d e f'.split())

In [26]:
df

          a         b         c         d         e         f
1  0.741756  0.490195 -0.017557  1.146958 -1.390886 -0.546304
2 -0.749803 -0.434820 -1.149022 -0.980848  1.171884  1.309398
3  0.170605 -0.142284  0.176631  0.000651  1.076438 -1.550244
4  0.287727  2.300526  0.874020  0.882470  0.918033  0.148001
5 -0.004070  0.584084 -0.537165 -1.127918 -0.128077  0.042675
6  1.154324  0.402193 -0.083961  1.782046 -1.123305 -0.013831
7 -0.690372 -1.285993  0.061747  1.630719  1.099995  0.137314
8  2.047979 -0.050194  0.233668  0.411728 -1.153728  0.416850

In [27]:
df.loc[[3,4],['b','e']]

          b         e
3 -0.142284  1.076438
4  2.300526  0.918033

In [28]:
df.iloc[[2,3],[1,4]]

          b         e
3 -0.142284  1.076438
4  2.300526  0.918033

4. Create a multi-index dataframe and 1st index is ["CSE","IT"] and second index is 1 to 6 numbers. use 2 columns A,B and assign random values to it

In [29]:
branch = ['CSE','CSE','CSE','CSE','CSE','CSE','IT','IT','IT','IT','IT','IT']
members = [1,2,3,4,5,6,1,2,3,4,5,6]
hier_index = list(zip(branch,members))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [31]:
df = pd.DataFrame(np.random.randn(12,2),index=hier_index,columns=['A','B'])

In [32]:
df

              A         B
CSE 1 -0.247700  0.776332
    2  1.382927  1.466541
    3  0.319279  2.568837
    4 -2.044290 -0.181345
    5  0.126861 -0.802067
    6  0.864185 -0.728821
IT  1 -0.491734  0.316384
    2  1.113751  1.100011
    3  0.646119 -0.876807
    4 -1.056345 -0.995827
    5  0.185989  0.430738
    6  0.072223 -0.208916

5.Print the row value of number 4 from cse

In [38]:
df.loc['CSE'].loc[4]

A   -2.044290
B   -0.181345
Name: 4, dtype: float64

6.Print the row value of 3,5 from IT

In [35]:
df.loc['IT'].loc[[3,5]]

          A         B
3  0.646119 -0.876807
5  0.185989  0.430738